estacionate/app/Controllers/HomeController.php

    public function ver_estacionamientos()
    {
       $estacionamiento = new EstacionamientoModel();
       $est = $estacionamiento->orderBy('id_estacionamiento')->findall();
       $estcar = new CaractEstacionamientoModel();
       $caract =[];
       $cont = 0;
       foreach ($est as $key ) {
          $caract[$cont++] = $estcar->join('caracteristicas','caracteristicas.id_caracteristica =caract_estacionamiento.id_caracteristica')->where('id_estacionamiento',$key['id_estacionamiento'])->findall();
---
SELECT *
FROM `estacionamientos`
ORDER BY `id_estacionamiento`
SELECT *
FROM `caract_estacionamiento`
JOIN `caracteristicas` ON `caracteristicas`.`id_caracteristica` =`caract_estacionamiento`.`id_caracteristica`
WHERE `id_estacionamiento` = '5'