estacionate/app/Models/CaractEstacionamientoModel.php

        public function insertarDatos($data){
                        $cliente = $this->db->table($this->table);
                         $cliente->insert($data);
---
INSERT INTO `caract_estacionamiento` (`id_estacionamiento`, `id_caracteristica`) VALUES (23, '1')