estacionate/app/Models/CaracteristicaModel.php

SELECT *
FROM `caracteristicas`
---
        public function obtenertodos() {
                        $cliente = $this->db->table($this->table);
                        $cliente->select('*');

                        return $cliente->get()->getResultArray();