estacionate/app/Models/EstacionamientoModel.php

INSERT INTO `estacionamientos` (`nombre`, `latitud`, `longitud`, `capacidad`, `palabras_clave`) VALUES ('ggggg', '-16.3250176', '-71.5358208', '34', 'cercado,vallecito,isur,utp,salaverry')
---
        public function insertarDatos($data){
                       if ($this->insert($data)) {